<script lang="ts" setup>
import { ref } from 'vue'
const Messages = ref([
  {
    title: '2021起始篇',
    time: '2021-11-28',
    msg: `王珊珊~! 
                <br>从第一次见面,不不不,从看到你的照片开始,我就被你深深吸引了,短短几个星期的接触,母胎单身多年的我鼓起勇气向你表白了!
                <br>今天凌晨你点头那一刹那,我感觉整个世界都是我的.蓝桉已遇释槐鸟,不爱万物唯爱你!我会把我能给你的最好的给你.
                <br>我会以我的方式对你好,有些时候我可能做得没有别人好,你大可直接告诉我,我可以学!
                <br>遇到不开心,难过,无聊的时候,随时都可以找我,我一直都在,无论多晚,不必怕打扰我,我高兴还来不及呢你可以随时知道我在哪里,在干嘛,你喊我一下我立马想办法出现在你面前!
               <br>请给我一点时间,让我慢慢发光,让我陪你走下去.
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2021圣诞篇',
    time: '2021-12-25',
    msg: `我滴乖宝,圣诞节快乐~!
                <br>今天是2021年12月25日,这是我陪你过的第一个圣诞节,很开心我们出现在彼此的生命里,成为彼此最重要的人,但希望我在你眼里,依然是最好的宝贝
                <br>想跟你去很多地方,看时间各地的风景,吃好吃的美食,牵着你的手,走最远的路,想和你一起去探索这个有趣的世界,一起努力成长,变成更好的人。
                <br> 我想以后天天有你的陪伴,我想牵你的手,一起去逛公园,我想搂着你入睡,难过时想抱着你,希望我们都在彼此未来的规划里
                <br>未来的路很长,希望所有的绊脚石,都是以后惊喜的铺垫,希望这份特别的礼物能让你感受到我满满的爱意与幸福感~
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2022元旦篇',
    time: '2022-01-01',
    msg: `我滴小公举,元旦快乐~!
                <br>今天是 2022年 一月一号,是我陪你过的第一个元旦,三生有幸能认识你,认识你我明白有一种感情叫永远,离开你我体会有一种情感叫思念,在这个没有花儿芬芳却浓情四溢的季节,我想和你说：有我你不会孤单.
                <br>是你给我的世界涂上了色彩,你让我世界从此有了颜色,是你让我觉得我还可以再努力努力,为了我和我们的以后,我必将全力以赴.
                <br>现在不管干嘛都能想到你,吃饭的时候想这道菜 你会不会喜欢吃,以后带你过来吃, 看到一些可爱的小玩意的时候会想到要是突然把它送给你,你会不会很开心,每次手机响起,都想是不是我家宝贝给我发消息了,种种种种.....
                <br>一想到你,我的脸上总是洋溢着笑容.我想和你走的很远很远,一直 走下去
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2022生日篇',
    time: '2022-01-10',
    msg: `宝宝,生日快乐~!
                <br>喜欢你大概是这个世界上,最独断没有道理的事了,不是权衡利弊,不是见色起意,而是突然间有了一个你让我牵肠挂肚,割舍不下。
                <br>你是我安稳岁月里的节外生枝,是我平淡生活里的日月星辰。
                <br>不管是清晨的日出,还是正午的小憩,又或是漫天星辰的夜晚,我都想和你一起度过。别怀疑我为什么爱你,心决定的东西,嘴解释不了,就像鱼恋着海,鸟儿恋着天空,我也不太懂这是什么道理,我想这就好像呼吸,不用练习,只因为是你。
                <br>遇见你是故事的开始,走到底是余生的欢喜。有一个喜欢的人真是太好了。我浪费光阴虚度岁月的时候,觉得人间不过如此。
                <br>但爱上你之后我开始渴望长命百岁,觉得人间值得！你比我幸运,因为你可以选择爱我或不爱我,而我只能选择爱你或者更爱你。
                <br>林徽因的诗里写到：“你是一树一树的花开,是燕,在梁间呢喃,你是爱,是暖,是希望,你是人间的四月天。”
                <br>一生不轻爱,一爱爱一生。
                <br>我不敢说自己一生都会喜欢你,至少在能看见你的岁月里,只想对你一个人好。纵使生活没那么容易,我还是想把你放在未来里,一生欢喜,不为世俗所染。
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2022春节篇',
    time: '2022-02-01 ',
    msg: `宝宝,春节快乐~!
                <br>这是我第一次和你说新年快乐,我不说恭喜发财,也不说前程似锦。我只希望你在新的一年里平平安安,快快乐乐。
                <br>愿你做一个小太阳,而我这颗万千星辰里蕞普通的一粒星,会永远围绕你左右,护你平安,我爱你,新年快乐。
                <br>很感谢宝宝在今年结尾以女朋友的身份出现在我的生命中让我这乱糟糟的一年有一个完美的收场
                <br>马上就是新的一年,我要和你谈上好几年,我会和你熬过所有新鲜感和平淡期,我也不想重新认识任何人,我只要和你一直一直在一起.
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2022情人节篇',
    time: '2022-02-14',
    msg: `宝宝,情人节快乐~!
                <br>也许我们相遇是偶然,相恋是意外,那么以后的相知,相爱、相守都是必然,因为那都是我们努力奔向对方的证明呐。每晚睡前听你说晚安,是属于我最简单而持久的幸福。
                <br>我的期待有很多,比如睡到自然醒,比如醒来就能看到我爱的天气和你。只要一想到能和你共度余生,我就对余生充满期待。
                <br>我想和你相拥在一起,数落着你的可爱,吐槽着你的不是,想看你趴在我怀里睡着的脸庞,想看你吃东西时候鼓起的嘴,那时候我估计我会忍不住去亲你一下吧！
                <br>在未来的日子里,也许什么都无法确定,但我有一件事可以确定,我会一直爱你,无论现在还是将来,我想我这里都会是你最温暖的港湾,都是为你遮风避雨的城墙
                <br>无论狂风,无论暴雨,我都会陪在你的身旁,让你不会感到丝毫的担心和惶恐。
                <br>希望以后和你的生活,温柔,有趣,不必太激烈,三餐,四季,不必太匆忙,毕竟我有一生的时间要和你浪费。
                <br>我会珍惜和你在一起的每一刻,每一分,每一秒
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2022分手篇',
    time: '2022-02-24',
    msg: `珊珊
                <br>在你提出分手的一刹那,我都不明白发生了什么,明明处的挺好的两个人怎么突然就..., 在爱情方面我笨笨的,给不了你想要的恋爱,但我是发自内心的喜欢你,想去很好的守护你,去爱你,我不是没主见,只是你的意见对我来说很重要,为了你我什么都可以去尝试,去学,我很乐意
                <br>我不能一直卑微的求你回来,你是我这辈子最想拥有的人,也是我最不想放弃的人,我曾经向所有人炫耀过你,可是现在的我呢,要满着所有人偷偷爱你,不纠缠的道理我听了无数遍,
                <br>可是真的面对你的时候,我也真的做不到,也许你觉得累了就要放手,不爱了就要分开,也许最后我们还是不能在一起,但是也别辜负了我们的相知相遇相爱,
                <br>人这辈子幸运两次就够了,一次遇见你,一次陪你走到底,给彼此一点时间,我们在前方碰头
                <br>王珊珊~! 我喜欢你~~~!!!`,
  },
  {
    title: '2022回忆篇',
    time: '2022-03-14',
    msg: `珊珊
                <br>在这大半个月的时间里,时间过得好慢,每个夜晚都特别难熬,上班+面试,想让自己变得忙碌起来,努力让自己不去想你,但真的办不到
                <br>我比任何人都爱你,比任何人都想让你开心,比任何人都想和你在一起,但我在你心里我似乎始终比不过别任何人
                <br>我坚持不联系你,不是我不想你,更不是我不要你,而是你给我的感觉我是在打拢你,我明白了有些关系除了再见别无选择
                <br>我时不时会偷偷看看你的朋友圈,看到你最近过得挺好,我心里也能好过一点,没能成为你心中理想的样子,给了你不好恋爱的体验,我很抱歉,
                    但我也在努力变好,变得有主见,能够让你足够的信任和依赖,你的未来有阳光和鲜花,还有幸福,只是可能没有我.
                `,
  },
  {
    title: '2022回忆篇(1)',
    time: '2022-03-28',
    msg: `珊珊
                <br>自从和你分开之后,对任何事情都提不起兴趣,以前的我阳光快乐,从来不会羡慕任何人,现在的我却少了那份自信,更找不到那个快乐真实的自己了.
                <br>你曾是我唯一的偏爱,可现在,却是我爱而不得的遗憾,其实挺不甘心的,在一起那么久,已经习惯了有你,我以为我们会义无反顾的爱着对方,一直都到最后.
                <br>让我猝不及防的是,你说不爱就不爱了,你的冷漠让我觉得好陌生啊,可冷静过后,我也想通了,爱是不能强求的,放手,也是我最后爱你的方式.
                <br>我会记住你曾经爱过我的样子,记住你微笑的嘴角和眼眸,记住你给我的温暖和信心,记住你给过我最最珍贵的所有,谢谢你在我人生旅程中画上了刻骨铭心又绚烂的一笔.
                <br>别停下脚步,继续前行,我也会努力改变自己,不为他人为自己,成为更加优秀的自己.`,
  },
  {
    title: '2022回忆篇(2)',
    time: '2022-06-15',
    msg: `今天的公司门口的荷花开的很漂亮,想拍张照给你看,忽然想到我们已经很久没有联系了,那花好像也没多好看了
            <br>很奇怪,明明都快四个月了,还是忘不掉,到处都是她的影子,干什么都能想到她
            <br>这就是爱而不得的感觉嘛?但是我并没有觉得这感觉很糟糕
            <br>听说世上只有两件事不会辜负自己,学习和健身,好像说的挺对的,在爱别人之前要学会先爱自己
            <br>生活会把该你的东西都给你,或早或晚
      `,
  },
  {
    title: '2022回忆篇(3)',
    time: '2022-07-18',
    msg: `今天去湖北省公安厅出差办公路过街道口,上周五也路过了，好像每周都要路过
            <br>到哪儿都能仿佛能看大你的影子,明明只有不到三个月的时间,却还是忘不掉
            <br>可能只是我一厢情愿,可能会尴尬,会不自在,会难受,但我还是想见你一面
            <br>以前总想着放假可以休息，可以放松出去玩一下，现在有点不太想放假了，想一直上班
            <br>时间并不会帮我们解决问题，它只是把原来我们怎么也想不通的问题，变得不那么重要了
            <br>所谓成长就是可以笑着说出当年令自己撕心裂肺的事
      `,
  },
])
const showText = (index: any) => {
  const textHeight = document.getElementsByClassName(`text${index}`)[0].clientHeight
  const collBoxIndex: any = document.getElementsByClassName(`collBox${index}`)[0]
  const iconIndex: any = document.getElementsByClassName(`icon${index}`)[0]
  if (collBoxIndex.classList.contains('isActive')) {
    collBoxIndex.classList.remove('isActive')
    collBoxIndex.style.height = `${12 * 0.25 * 16}px`
    iconIndex.style.transform = 'rotate(0deg)'
  } else {
    collBoxIndex.classList.add('isActive')
    collBoxIndex.style.height = `${18 * 0.25 * 16 + textHeight}px`
    iconIndex.style.transform = 'rotate(90deg)'
  }
}
</script>

<template>
  <div class="demo-collapse">
    <div v-for="(item, index) in Messages" :key="index" class="collBox" :class="`collBox${index}`">
      <div class="title cursor-pointer" @click="showText(index)">
        <span>{{ item.title }}</span>
        <span flex items-center
          >{{ item.time }}
          <div class="i-carbon:chevron-right ml-4 iconRight" :class="`icon${index}`" />
        </span>
      </div>
      <div class="px-12 py-4 text-left lh-8" :class="`text${index}`" v-html="item.msg" />
    </div>
  </div>
</template>

<style scoped lang="less">
.demo-collapse {
  width: 100%;

  .collBox {
    height: 48px;
    overflow: hidden;
    transition: all 0.5s;

    .title {
      display: flex;
      justify-content: space-between;
      align-items: center;
      padding: 10px;
      border-bottom: 1px solid #e6e6e6;

      .iconRight {
        transition: all 0.5s;
      }
    }

    p {
      text-align: center;
      transition: all 0.5s;
    }

    .hid {
      display: none;
    }
  }

  .msg {
    line-height: 30px;
  }

  .time {
    flex: 1;
    text-align: right;
    margin-right: 1rem;
  }

  /deep/.el-collapse-item__header {
    background: transparent;
  }

  /deep/.el-collapse-item__wrap {
    background: transparent;
  }
}
</style>
